{
  "username": "arsenne",
  "user_url": "https://www.reddit.com/user/arsenne",
  "posts": [
    {
      "title": "How did water snakes evolve?",
      "subreddit": "askscience",
      "permalink": "https://reddit.com/r/askscience/comments/1lyzdwo/how_did_water_snakes_evolve/",
      "type": "text",
      "posted_on": "2025-07-13T18:03:10+00:00",
      "upvotes": 114,
      "content": "The idea that water snakes exist bothers me.. no fins, just slithering through water. What did they evolve from? Were they just regular land snakes that went back into the water and found their niche? Do they come from a common ancestor that branched off into land snakes and water snakes? Can they breathe underwater or do they need to surface? Are they cold blooded, and if so, how do they warm up? So many questions"
    },
    {
      "title": "Recommendations for brands that sell trays with same cluster length",
      "subreddit": "lashclusters",
      "permalink": "https://reddit.com/r/lashclusters/comments/1ltpa3x/recommendations_for_brands_that_sell_trays_with/",
      "type": "image",
      "posted_on": "2025-07-07T09:00:12+00:00",
      "upvotes": 7,
      "external_link": "https://i.redd.it/0pwjzqd53fbf1.jpeg"
    },
    {
      "title": "what color do you describe your lynx point as?",
      "subreddit": "lynxpointsiamese",
      "permalink": "https://reddit.com/r/lynxpointsiamese/comments/1lnniqb/what_color_do_you_describe_your_lynx_point_as/",
      "type": "text",
      "posted_on": "2025-06-29T19:39:03+00:00",
      "upvotes": 20,
      "content": "curious to see what you guys say when you describe your cat. i still call her a white cat, despite her being very toasty now and and only getting more toasty as we speak. she also gets called gray or beige, but i still see her as the little white kitten that showed up under my car!"
    },
    {
      "title": "Buying a used litter robot 3. What to look out for?",
      "subreddit": "litterrobot",
      "permalink": "https://reddit.com/r/litterrobot/comments/1hx3x7r/buying_a_used_litter_robot_3_what_to_look_out_for/",
      "type": "text",
      "posted_on": "2025-01-09T03:45:33+00:00",
      "upvotes": 3,
      "content": "Title says it all. Found a litter robot 3 on offerup in my area for $150, seller doesn’t have cats anymore and is looking to get rid of it. He says it he had it for a little over a year but the price seems to good to be true. Never owned one, what parts should I look out for and what should I test to make sure he’s not selling me a broken one?"
    },
    {
      "title": "Cut my cat’s nail too short, can she still use clay litter?",
      "subreddit": "CatAdvice",
      "permalink": "https://reddit.com/r/CatAdvice/comments/1dut88p/cut_my_cats_nail_too_short_can_she_still_use_clay/",
      "type": "text",
      "posted_on": "2024-07-04T00:06:06+00:00",
      "upvotes": 1,
      "content": "I accidentally cut my cat’s nail too short, it wasn’t bleeding too badly but I put kwikstop on it anyways. Is it okay for her to use clay litter for now? I don’t want the grains to potentially get inside her nail while she digs and get infected. I also have wooden pellets too. \n\nThanks!"
    },
    {
      "title": "Just received this spider plant from a friend who couldn’t take care of it. It’s quite sad looking, what are my first steps in nurturing it back to health?",
      "subreddit": "plantclinic",
      "permalink": "https://reddit.com/r/plantclinic/comments/i9bc7v/just_received_this_spider_plant_from_a_friend_who/",
      "type": "link",
      "posted_on": "2020-08-13T23:59:54+00:00",
      "upvotes": 2,
      "external_link": "https://www.reddit.com/gallery/i9bc7v"
    },
    {
      "title": "Help! Could this browning be from under or overwatering on my majestic palm? All the leaves look like this and the trunk looks dead and brown.",
      "subreddit": "plantclinic",
      "permalink": "https://reddit.com/r/plantclinic/comments/i8hq6f/help_could_this_browning_be_from_under_or/",
      "type": "link",
      "posted_on": "2020-08-12T17:12:39+00:00",
      "upvotes": 1,
      "external_link": "https://www.reddit.com/gallery/i8hq6f"
    },
    {
      "title": "What’s with these droopy, limp leaves on my pothos? It’s only these 4 leaves and the rest of the plant is fine",
      "subreddit": "plantclinic",
      "permalink": "https://reddit.com/r/plantclinic/comments/i8hcw0/whats_with_these_droopy_limp_leaves_on_my_pothos/",
      "type": "link",
      "posted_on": "2020-08-12T16:53:44+00:00",
      "upvotes": 1,
      "external_link": "https://www.reddit.com/gallery/i8hcw0"
    },
    {
      "title": "Raised white/brown bumps and curling leaves on snake plant? Bacterial or fungal and how can I treat it?",
      "subreddit": "plantclinic",
      "permalink": "https://reddit.com/r/plantclinic/comments/i3op3n/raised_whitebrown_bumps_and_curling_leaves_on/",
      "type": "link",
      "posted_on": "2020-08-04T18:24:17+00:00",
      "upvotes": 1,
      "external_link": "https://www.reddit.com/gallery/i3op3n"
    },
    {
      "title": "Brown, white raised bumps and curling leaves on snake plant? What can I do to treat it?",
      "subreddit": "houseplants",
      "permalink": "https://reddit.com/r/houseplants/comments/i3ojhj/brown_white_raised_bumps_and_curling_leaves_on/",
      "type": "link",
      "posted_on": "2020-08-04T18:16:10+00:00",
      "upvotes": 3,
      "external_link": "https://www.reddit.com/gallery/i3ojhj"
    },
    {
      "title": "Trouble downloading transcripts online",
      "subreddit": "IRS",
      "permalink": "https://reddit.com/r/IRS/comments/gw1f8o/trouble_downloading_transcripts_online/",
      "type": "text",
      "posted_on": "2020-06-03T20:02:22+00:00",
      "upvotes": 3,
      "content": "I need to download a \"proof of non-filing\" transcript for financial aid purposes. However it tries to download it as an .xhtml file, then says the download failed and there is a network error. What can I do to solve this? I'm on mac"
    },
    {
      "title": "IWTL how to think verbally instead of thinking visually",
      "subreddit": "IWantToLearn",
      "permalink": "https://reddit.com/r/IWantToLearn/comments/aas322/iwtl_how_to_think_verbally_instead_of_thinking/",
      "type": "text",
      "posted_on": "2018-12-30T03:05:29+00:00",
      "upvotes": 139,
      "content": "I am a huge visual thinker and I learn visually too. I can’t really visualize or articulate sentences in my head, so it’s hard to convey what I’m trying to say because it’s all pictures inside my head. I realize that this affects my social skills too, because I just sound dumb as hell and I make a lot of pauses and stutters in my speech. I usually have to put a lot of thought in what I want to say, otherwise it’ll come out wrong or the words get all mixed up in my sentences. It gives me anxiety and makes me feel dumb, but I know I don’t have this problem when I text or write essays. Much appreciation for the help.   \n\nEdit: This post got more attention than I thought it would. It’s nice to know that some people are the same way and I’m not alone in this! A lot of people are suggesting draw..."
    }
  ],
  "comments": [
    {
      "post_title": "Is Mark k worth it?",
      "post_subreddit": "PassNclex",
      "post_permalink": "https://reddit.com/r/PassNclex/comments/1ly9dxp/is_mark_k_worth_it/",
      "timestamp": "2025-07-13T19:57:37+00:00",
      "text": "i believe he says in one of his lectures that the nclex will change about 10% every 4 years. anyone know wonder how it actually changes, besides new question styles? surely the concepts we need to know wont change much."
    },
    {
      "post_title": "“kibbles dont clean their teeth”",
      "post_subreddit": "CatAdvice",
      "post_permalink": "https://reddit.com/r/CatAdvice/comments/1lyymow/kibbles_dont_clean_their_teeth/",
      "context_author": "Mother_Feedback8633",
      "timestamp": "2025-07-13T18:39:41+00:00",
      "context": "It’s the wheat, gluten and dairy which contain sugars. Sugars are bad for teeth! I wouldn’t recommend gravy cat food, pate type in broth would be the best. In the UK we have good brands with food in nutritional broth!",
      "text": "makes sense, thanks! i usually feed pate, and sometimes fancy feast pate since im on a budget and its grain free. glad that there aren’t any other ingredients in it that are bad."
    },
    {
      "post_title": "“kibbles dont clean their teeth”",
      "post_subreddit": "CatAdvice",
      "post_permalink": "https://reddit.com/r/CatAdvice/comments/1lyymow/kibbles_dont_clean_their_teeth/",
      "context_author": "CincySnwLvr",
      "timestamp": "2025-07-13T17:55:43+00:00",
      "context": "Gingivitis is not caused by wet food. Some cats have worse teeth than others due to genetics. Some wet foods are worse than others due to their ingredient list (looking at you, Fancy Feast). If you are feeding a high quality wet food, the bad teeth are most likely due to genetics.. which would make it even more imperative that you figure out how to give them regular brushings.\n\nAnecdotally, two of my cats are litter mates that I’ve had since they were 6 weeks old. One had her first dental at 2 years old and again at 4 years because her teeth were horrible.. the other at 5 years old still has perfect teeth. Both have the exact same diet and lifestyle but completely different mouths.",
      "text": "can you elaborate on which ingredients make fancy feast bad for teeth and what other ingredients to look out for when looking at cat food? is it the wheat gluten and gravy? genuinely curious!"
    },
    {
      "post_title": "Recommendations for brands that sell trays with same cluster length",
      "post_subreddit": "lashclusters",
      "post_permalink": "https://reddit.com/r/lashclusters/comments/1ltpa3x/recommendations_for_brands_that_sell_trays_with/",
      "context_author": "Ymisoqt420",
      "timestamp": "2025-07-13T18:36:05+00:00",
      "context": "I must have gotten one of the last shipments because I literally JUST got some of the flora ones lol they added me to a WhatsApp group and I don't see any lashes posted",
      "text": "i just checked and it looks like theyre back in stock on amazon! just in time for prime day"
    },
    {
      "post_title": "Recommendations for brands that sell trays with same cluster length",
      "post_subreddit": "lashclusters",
      "post_permalink": "https://reddit.com/r/lashclusters/comments/1ltpa3x/recommendations_for_brands_that_sell_trays_with/",
      "context_author": "Ymisoqt420",
      "timestamp": "2025-07-07T18:36:21+00:00",
      "context": "I use these too where did they go 😭",
      "text": "i was so distraught when i saw they were unavailable, they were in my cart too!!"
    },
    {
      "post_title": "Tipping culture is out of hand",
      "post_subreddit": "mildlyinfuriating",
      "post_permalink": "https://reddit.com/r/mildlyinfuriating/comments/1lnpkct/tipping_culture_is_out_of_hand/",
      "timestamp": "2025-06-30T07:46:57+00:00",
      "text": "there’s a retail store that i go to that has a tipping option on the POS. i would give them the benefit of the doubt that they maybe can’t remove it on the POS, if it weren’t for the flashy tip jar they have"
    },
    {
      "post_title": "ELI5: What does it mean when police say, \"You don’t have to say anything, but it may harm your defence if you do not mention when questioned something which you later rely on in court\"?",
      "post_subreddit": "explainlikeimfive",
      "post_permalink": "https://reddit.com/r/explainlikeimfive/comments/1lmxiih/eli5_what_does_it_mean_when_police_say_you_dont/",
      "context_author": "swedinator",
      "timestamp": "2025-06-29T02:57:39+00:00",
      "context": "Because the court can question and draw adverse inference why you suddenly claim something for the first time in court when you have had the opportunity to tell your story earlier.\n\nThis applies to the UK (or at least England and Wales) and not the US where prosecutors are prohibited from telling the jury that you exercised your right to remain silent.",
      "text": "curious, but why does it matter if the jury is told that someone exercised their right to remain silent? has it become a problem in the past where the jury has become swayed because of that, and that’s why prosecutors are prohibited from doing so in the US?"
    },
    {
      "post_title": "Does anyone have the Mark K notes?",
      "post_subreddit": "NursingStudent",
      "post_permalink": "https://reddit.com/r/NursingStudent/comments/1ktz3zx/does_anyone_have_the_mark_k_notes/",
      "context_author": "2020R1M",
      "timestamp": "2025-05-28T06:44:25+00:00",
      "context": "https://drive.google.com/drive/mobile/folders/1Dda43n-ob6eNeyOxUWLAlH_e78smQ1He\n\nMy fiancé is studying for her NCLEX as well and told me to post this",
      "text": "Thank you so much for you and your fiancé!"
    },
    {
      "post_title": "Meirl",
      "post_subreddit": "meirl",
      "post_permalink": "https://reddit.com/r/meirl/comments/1kwknp9/meirl/",
      "timestamp": "2025-05-28T02:13:30+00:00",
      "text": "this is post is how i found out i was conceived on my brother’s birthday"
    },
    {
      "post_title": "Is anyone else considering med school later on? I’m starting with nursing for a few reasons",
      "post_subreddit": "StudentNurse",
      "post_permalink": "https://reddit.com/r/StudentNurse/comments/1kwpqps/is_anyone_else_considering_med_school_later_on_im/",
      "context_author": "girlrunner3",
      "timestamp": "2025-05-28T02:09:27+00:00",
      "context": "Totally agree with you. I wish there was a bigger focus on the science behind a lot of the things we’re learning",
      "text": "There are so many instances during lectures where we are just told something or to memorize something without them actually explaining why. I feel like pathophysiology was my only class that actually explained concepts deeply, making it much easier to grasp the content"
    },
    {
      "post_title": "Is anyone else considering med school later on? I’m starting with nursing for a few reasons",
      "post_subreddit": "StudentNurse",
      "post_permalink": "https://reddit.com/r/StudentNurse/comments/1kwpqps/is_anyone_else_considering_med_school_later_on_im/",
      "timestamp": "2025-05-27T21:07:03+00:00",
      "text": "i share the same sentiment and i’m glad to hear that someone else is also considering med school later on too! getting my BSN right now and i’m disappointed in how lackluster the classes feel. it feels like we focus so much on a lot of fluff in nursing school rather than learning more science."
    },
    {
      "post_title": "Is my boy lynx point siamese",
      "post_subreddit": "lynxpointsiamese",
      "post_permalink": "https://reddit.com/r/lynxpointsiamese/comments/1ktlrh3/is_my_boy_lynx_point_siamese/",
      "context_author": "salalo",
      "timestamp": "2025-05-23T22:10:30+00:00",
      "context": "Right? he is so cute, he is actually cuter in real life(not really a photogenic fellow). He is well behaved boy too.",
      "text": "are you kidding, he’s insanely photogenic"
    },
    {
      "post_title": "Nursing sounds scary to me, and I'm in my first year of nursing school",
      "post_subreddit": "StudentNurse",
      "post_permalink": "https://reddit.com/r/StudentNurse/comments/1k4g7c2/nursing_sounds_scary_to_me_and_im_in_my_first/",
      "timestamp": "2025-04-21T20:42:37+00:00",
      "text": "Besides the other comments here, I want to add that social media (especially tiktok) is like an echo chamber. Negative stories about nurses are amplified and seem like they happen FREQUENTLY. Don’t get me wrong, these things do happen, but this is why you’re in nursing school! You’re learning all of these things and practicing these skills so that you become a competent nurse. Nursing school is rigorous for a reason, they don’t pass you unless they believe you will be a safe and competent nurse."
    },
    {
      "post_title": "What is college like as a nursing student?",
      "post_subreddit": "NursingStudent",
      "post_permalink": "https://reddit.com/r/NursingStudent/comments/1jd43ku/what_is_college_like_as_a_nursing_student/",
      "timestamp": "2025-03-17T18:14:56+00:00",
      "text": "you can get definitely get away with it when you’re doing your prerequisites, however the workload definitely gets heavier and heavier when you get into your program. you unfortunately will have to make some sacrifices when it comes to going out to parties, festivals, etc. and learning how to say no. but if you think about it, it’s a 1 1/2-2 year (or however long your program is) sacrifice. after you graduate, you can go all out but this time with nursing money."
    },
    {
      "post_title": "ULPT Request: How do I make my ex boyfriend’s life as inconvenient but technically legal as I can before I move out?",
      "post_subreddit": "UnethicalLifeProTips",
      "post_permalink": "https://reddit.com/r/UnethicalLifeProTips/comments/1iw9pgw/ulpt_request_how_do_i_make_my_ex_boyfriends_life/",
      "context_author": "im_intj",
      "timestamp": "2025-02-23T16:51:47+00:00",
      "context": "You let it go and move on and heal from the experience. You will never find any peace with any of this until you release it.",
      "text": "but that’s too ethical"
    },
    {
      "post_title": "ATI Dynamic Quizzes",
      "post_subreddit": "StudentNurse",
      "post_permalink": "https://reddit.com/r/StudentNurse/comments/1icjcuf/ati_dynamic_quizzes/",
      "context_author": "Tricky_Block_4078",
      "timestamp": "2025-02-07T02:57:51+00:00",
      "context": "There’s a search feature that you can type the topics but it isn’t always useful.",
      "text": "how do you access this search feature?"
    },
    {
      "post_title": "As a nurse with a baby in the NICU, his itemized bill was so eye opening.",
      "post_subreddit": "nursing",
      "post_permalink": "https://reddit.com/r/nursing/comments/1hx6s49/as_a_nurse_with_a_baby_in_the_nicu_his_itemized/",
      "context_author": "linkipinkiwinkie",
      "timestamp": "2025-01-09T18:58:35+00:00",
      "context": "Blame administration though, not the lab. The people running the tests are often as understaffed/underpaid as nurses!",
      "text": "unfortunately this has been a problem much longer than the Biden Administration"
    },
    {
      "post_title": "Why do cats love chasing laser pointers? Is it good for them?",
      "post_subreddit": "CatAdvice",
      "post_permalink": "https://reddit.com/r/CatAdvice/comments/1hx1s0l/why_do_cats_love_chasing_laser_pointers_is_it/",
      "timestamp": "2025-01-09T02:25:50+00:00",
      "text": "It can definitely frustrate them if you don’t award them with an actual “catch” or with a treat. When I wasn’t home, my roommate would let her boyfriend use the laser pointer to play with my cat, but it was more for his entertainment than for my cat. My cat now spends a good amount of time staring at walls, especially when she sees little light reflections."
    },
    {
      "post_title": "\"Bi-weekly Friend Code Thread - 12/06/24\".",
      "post_subreddit": "tinytower",
      "post_permalink": "https://reddit.com/r/tinytower/comments/1h7wh7z/biweekly_friend_code_thread_120624/",
      "timestamp": "2024-12-18T06:11:44+00:00",
      "text": "Daily player, Elevator 9.50, Return all visits :)"
    },
    {
      "post_title": "One of the worst articles of the press I’ve read about Luigi Mangione",
      "post_subreddit": "self",
      "post_permalink": "https://reddit.com/r/self/comments/1hcgtb7/one_of_the_worst_articles_of_the_press_ive_read/",
      "context_author": "Rayne_420",
      "timestamp": "2024-12-12T09:18:40+00:00",
      "context": "Trying to muddy the issue by making it about race, one of the things that the ruling class keeps using to divide us.",
      "text": "They’re also trying to make it into a left vs right issue.. yet healthcare disparities affect both sides."
    },
    {
      "post_title": "How I manage to take my meds every morning",
      "post_subreddit": "ADHD",
      "post_permalink": "https://reddit.com/r/ADHD/comments/1hcgtcx/how_i_manage_to_take_my_meds_every_morning/",
      "timestamp": "2024-12-12T09:15:59+00:00",
      "text": "It works because you found a system that works for your ADHD brain :) big part of living with ADHD is just trial and error of finding silly little systems to help you do things throughout the day"
    },
    {
      "post_title": "What's the biggest disruption you've seen someone create in a public space just so they could take a goddamn selfie?",
      "post_subreddit": "AskReddit",
      "post_permalink": "https://reddit.com/r/AskReddit/comments/1hcgvc0/whats_the_biggest_disruption_youve_seen_someone/",
      "timestamp": "2024-12-12T09:05:53+00:00",
      "text": "Extending a selfie stick in a crowded sidewalk to take a family picture all whilst smacking people with it"
    },
    {
      "post_title": "What’s your food based guilty pleasure?",
      "post_subreddit": "AskReddit",
      "post_permalink": "https://reddit.com/r/AskReddit/comments/1hcgvix/whats_your_food_based_guilty_pleasure/",
      "timestamp": "2024-12-12T09:00:25+00:00",
      "text": "salami"
    },
    {
      "post_title": "TIL that most American Medical Organisations use the caduceus (☤), the Rod of Hermes(God of commerce, travellers, and thieves) rather than the asklepian(⚕), the Rod of Asclepius(God of Healing and Medicine)",
      "post_subreddit": "todayilearned",
      "post_permalink": "https://reddit.com/r/todayilearned/comments/1hcgxok/til_that_most_american_medical_organisations_use/",
      "timestamp": "2024-12-12T08:53:38+00:00",
      "text": "given our healthcare system, sounds about right"
    },
    {
      "post_title": "Let’s hear your stories: who has gotten f**ked over by United Healthcare?",
      "post_subreddit": "Health",
      "post_permalink": "https://reddit.com/r/Health/comments/1h6ttx2/lets_hear_your_stories_who_has_gotten_fked_over/",
      "context_author": "HomegirlNC123",
      "timestamp": "2024-12-05T17:16:25+00:00",
      "context": "Which is ridiculous because type 1 is so severe!! I have even known very thin people who had it.",
      "text": "Type 1 is caused autoimmune reasons, literally your body is attacking the cells that produce insulin. Weight is a contributing factor to Type 2 diabetes, because the increased adipocytes (fat cells) make it hard for insulin to bind to glucose in your body."
    },
    {
      "post_title": "A&P + Patho question",
      "post_subreddit": "StudentNurse",
      "post_permalink": "https://reddit.com/r/StudentNurse/comments/1h1bfyt/ap_patho_question/",
      "timestamp": "2024-11-27T20:06:12+00:00",
      "text": "I definitely recommend taking both A&P classes before taking Patho."
    },
    {
      "post_title": "Am I a bad owner for wanting another cat after my cat died yesterday at two am?",
      "post_subreddit": "CatAdvice",
      "post_permalink": "https://reddit.com/r/CatAdvice/comments/1h1aniw/am_i_a_bad_owner_for_wanting_another_cat_after_my/",
      "timestamp": "2024-11-27T19:17:44+00:00",
      "text": "I’m so sorry for your loss OP. There’s nothing wrong with wanting to adopt another cat, cats in shelters need homes too! As long as you’re able to care for them properly and you’re not adopting on a whim. But take all the time you need to grieve, remember grief is not linear and everyone processes it differently."
    },
    {
      "post_title": "[deleted by user]",
      "post_subreddit": "NoStupidQuestions",
      "post_permalink": "https://reddit.com/r/NoStupidQuestions/comments/1h1af0y/deleted_by_user/",
      "timestamp": "2024-11-27T18:56:07+00:00",
      "text": "It’s not a common thing that happens, but this did happen to me a couple years ago on a family vacation. My mom is the karen type and didn’t tip anything because the service was slow (restaurant was VERY busy). As we’re leaving, the waiter catches up to us outside the restaurant to confront my mom. Felt bad for her"
    },
    {
      "post_title": "Studying in Nursing School (with Anki!)",
      "post_subreddit": "StudentNurse",
      "post_permalink": "https://reddit.com/r/StudentNurse/comments/1guembu/studying_in_nursing_school_with_anki/",
      "timestamp": "2024-11-19T04:59:18+00:00",
      "text": "this is a very helpful guide thank you! do you mind sharing the decks you used to study?"
    },
    {
      "post_title": "Friendship Exp & Gift Exchange Megathread",
      "post_subreddit": "PokemonGoFriends",
      "post_permalink": "https://reddit.com/r/PokemonGoFriends/comments/zplrdb/friendship_exp_gift_exchange_megathread/",
      "timestamp": "2023-02-02T21:44:33+00:00",
      "text": "9207 0493 2523 i always send gifts back and play daily!!"
    }
  ]
}